Jicehel-Aka/dark_and_under_color/sdkconfig.defaults
# Valeurs par defaut pour Dark & Under (couleur), ESP32-S3, 8 Mo.
# ABSENT jusqu'ici -- c'est ce qui a fait partir le build sur la cible
# ESP32 classique par defaut au lieu de l'ESP32-S3 (voir le log de build
# de Jicehel : xtensa-esp32-elf-g++ au lieu de xtensa-esp32s3-elf-g++).

CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Noms de fichiers longs sur la carte SD -- meme necessite que pour
# dark_and_under_aka et poa_aka (dossier de sauvegarde
# "/sdcard/DarkUnderColor/" au-dela de la limite 8.3). Ne s'applique
# qu'a ce projet ESP-IDF autonome, pas a la coquille partagee des jeux
# natifs (qui reste en 8.3 strict).
CONFIG_FATFS_LFN_HEAP=y
